gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_UART.cpp

#if MainProtocol==698
#include "../H698/Project698.h"
#include "../DL698/DL698_DataDef.h"
#include "../DL698/DL698_Uart.h"
#include "../STM32F4xx/STM32F4xx_UART.h"
#include "../STM32F4xx/STM32F4xx_DMA.h"
#include "../STM32F4xx/STM32F4xx_RTC.h"
#include "../Device/MEMRW.h"
#include "../Calculate/Calculate.h"

#include "../DL698/DL698_LINK.h"
#include "../DL698/DL698_CONNECT.h"
#include "../DL698/DL698_GET.h"
#include "../DL698/DL698_SET.h"
#include "../DL698/DL698_ACTION.h"
#include "../DL698/DL698_REPORT.h"
#include "../DL698/DL698_PROXY.h"
#include "../DL698/DL698_SECURITY.h"
#include "../DL698/DL698_REPORT.h"
#include "../MS/MS.h"
#include "../TEST/LOG.h"



__align(4) const u16 fcstab[256] = {
0x0000, 0x1189, 0x2312, 0x329b, 0x4624, 0x57ad, 0x6536, 0x74bf,
0x8c48, 0x9dc1, 0xaf5a, 0xbed3, 0xca6c, 0xdbe5, 0xe97e, 0xf8f7,
0x1081, 0x0108, 0x3393, 0x221a, 0x56a5, 0x472c, 0x75b7, 0x643e,
0x9cc9, 0x8d40, 0xbfdb, 0xae52, 0xdaed, 0xcb64, 0xf9ff, 0xe876,
0x2102, 0x308b, 0x0210, 0x1399, 0x6726, 0x76af, 0x4434, 0x55bd,
0xad4a, 0xbcc3, 0x8e58, 0x9fd1, 0xeb6e, 0xfae7, 0xc87c, 0xd9f5,
0x3183, 0x200a, 0x1291, 0x0318, 0x77a7, 0x662e, 0x54b5, 0x453c,
0xbdcb, 0xac42, 0x9ed9, 0x8f50, 0xfbef, 0xea66, 0xd8fd, 0xc974,
0x4204, 0x538d, 0x6116, 0x709f, 0x0420, 0x15a9, 0x2732, 0x36bb,
0xce4c, 0xdfc5, 0xed5e, 0xfcd7, 0x8868, 0x99e1, 0xab7a, 0xbaf3,
0x5285, 0x430c, 0x7197, 0x601e, 0x14a1, 0x0528, 0x37b3, 0x263a,
0xdecd, 0xcf44, 0xfddf, 0xec56, 0x98e9, 0x8960, 0xbbfb, 0xaa72,
0x6306, 0x728f, 0x4014, 0x519d, 0x2522, 0x34ab, 0x0630, 0x17b9,
0xef4e, 0xfec7, 0xcc5c, 0xddd5, 0xa96a, 0xb8e3, 0x8a78, 0x9bf1,
0x7387, 0x620e, 0x5095, 0x411c, 0x35a3, 0x242a, 0x16b1, 0x0738,
0xffcf, 0xee46, 0xdcdd, 0xcd54, 0xb9eb, 0xa862, 0x9af9, 0x8b70,
0x8408, 0x9581, 0xa71a, 0xb693, 0xc22c, 0xd3a5, 0xe13e, 0xf0b7,
0x0840, 0x19c9, 0x2b52, 0x3adb, 0x4e64, 0x5fed, 0x6d76, 0x7cff,
0x9489, 0x8500, 0xb79b, 0xa612, 0xd2ad, 0xc324, 0xf1bf, 0xe036,
0x18c1, 0x0948, 0x3bd3, 0x2a5a, 0x5ee5, 0x4f6c, 0x7df7, 0x6c7e,
0xa50a, 0xb483, 0x8618, 0x9791, 0xe32e, 0xf2a7, 0xc03c, 0xd1b5,
0x2942, 0x38cb, 0x0a50, 0x1bd9, 0x6f66, 0x7eef, 0x4c74, 0x5dfd,
0xb58b, 0xa402, 0x9699, 0x8710, 0xf3af, 0xe226, 0xd0bd, 0xc134,
0x39c3, 0x284a, 0x1ad1, 0x0b58, 0x7fe7, 0x6e6e, 0x5cf5, 0x4d7c,
0xc60c, 0xd785, 0xe51e, 0xf497, 0x8028, 0x91a1, 0xa33a, 0xb2b3,
0x4a44, 0x5bcd, 0x6956, 0x78df, 0x0c60, 0x1de9, 0x2f72, 0x3efb,
0xd68d, 0xc704, 0xf59f, 0xe416, 0x90a9, 0x8120, 0xb3bb, 0xa232,
0x5ac5, 0x4b4c, 0x79d7, 0x685e, 0x1ce1, 0x0d68, 0x3ff3, 0x2e7a,
0xe70e, 0xf687, 0xc41c, 0xd595, 0xa12a, 0xb0a3, 0x8238, 0x93b1,
0x6b46, 0x7acf, 0x4854, 0x59dd, 0x2d62, 0x3ceb, 0x0e70, 0x1ff9,
0xf78f, 0xe606, 0xd49d, 0xc514, 0xb1ab, 0xa022, 0x92b9, 0x8330,
0x7bc7, 0x6a4e, 0x58d5, 0x495c, 0x3de3, 0x2c6a, 0x1ef1, 0x0f78
};

u32 Uart_698_HCS(u8 *p8)//帧头校验计算;返回0=正确，1=错误
{
	u32 i;
	u32 len;
	u32 HCS;
	
	p8++;
	len=p8[3]&0x0f;
	len+=6;
	HCS=0xffff;
	for(i=0;i<len;i++)
	{
		HCS=(HCS >> 8) ^ fcstab[(HCS ^ p8[i]) & 0xff];
	}
	HCS ^= 0xffff; // complement
	i=p8[len];
	i|=p8[len+1]<<8;
	p8[len] = HCS;//least significant byte first
	p8[len+1] = (HCS >> 8);
	if(i==HCS)
	{
		return 0;
	}
	return 1;
}
#include "../DL698/DL698_JSON.h"

u32 Uart_698_HCSFCS(u8 *p8)//整帧校验计算(HCS和FCS),同时加结束0x16;返回0=正确，1=错误
{
	u32 i;
	u32 len;
	u32 FCS;
	u32 Err;
	
	Err=Uart_698_HCS(p8);//帧头校验计算;返回0=正确，1=错误
	p8++;
	len=p8[0]+(p8[1]<<8);
	if(len<2)
	{
		return 1;
	}
	len-=2;
	FCS=0xffff;
	for(i=0;i<len;i++)
	{
		FCS=((FCS >> 8)&0xff) ^ fcstab[(FCS ^ p8[i]) & 0xff];
	}
	FCS ^= 0xffff; // complement
	i=p8[len];
	i|=p8[len+1]<<8;
	p8[len] = FCS;//least significant byte first
	p8[len+1] = (FCS >> 8);
	p8[len+2] = 0x16;
	if(i!=FCS)
	{
		Err=1;
	}
	
	return Err;
//#if DEBUG==0//0=发行,1=调试
//	return Err;
//#else
//	Err=Err;
//	return 0;
//#endif
}


u32 FrameProtocol_698_HCS(u8 *p8)//通信协议自动识别帧头校验计算;返回0=正确，1=错误
{
	u32 i;
	u32 len;
	u32 HCS;
	
	p8++;
	len=p8[3]&0x0f;
	len+=6;
	HCS=0xffff;
	for(i=0;i<len;i++)
	{
		HCS=(HCS >> 8) ^ fcstab[(HCS ^ p8[i]) & 0xff];
	}
	HCS ^= 0xffff; // complement
	i=p8[len];
	i|=p8[len+1]<<8;
	if(i==HCS)
	{
		return 0;
	}
	return 1;
}

u32 FrameProtocol_698_HCSFCS(u8 *p8)//通信协议自动识别整帧校验计算(HCS和FCS);返回0=正确，1=错误
{
	u32 i;
	u32 len;
	u32 FCS;
	u32 Err;
	
	Err=FrameProtocol_698_HCS(p8);//帧头校验计算;返回0=正确，1=错误
	p8++;
	len=p8[0]+(p8[1]<<8);
	if(len<2)
	{
		return 1;
	}
	len-=2;
	FCS=0xffff;
	for(i=0;i<len;i++)
	{
		FCS=((FCS >> 8)&0xff) ^ fcstab[(FCS ^ p8[i]) & 0xff];
	}
	FCS ^= 0xffff; // complement
	i=p8[len];
	i|=p8[len+1]<<8;
	if(i!=FCS)
	{
		Err=1;
	}
	return Err;
}

u32 FrameProtocol(u8* p8,u32 Len)//通信协议自动识别:返回:0=未知,1=DL/T645-1997,2=DL/T645-2007,3=DL/T698.45,4=CJ/T 188-2004,128=DL376.2
{
	u32 i;
	u32 x;
	u32 cs;
	
//去开始的0xfe
	for(i=0;i<Len;i++)
	{
		if(p8[i]!=0xfe)
		{
			break;
		}
	}
	p8+=i;
	Len-=i;
	if(Len==0)
	{
		return 0;
	}
//DL698
	if(p8[0]==0x68)
	{
		i=p8[1]|(p8[2]<<8);
		if(p8[1+i]==0x16)
		{
			if((i+2)==Len)
			{
				i=FrameProtocol_698_HCSFCS(p8);//通信协议自动识别整帧校验计算(HCS和FCS);返回0=正确，1=错误
				if(i==0)
				{
					return 3;//3=DL698
				}
			}
		}
	}
//DL645
	if(p8[0]==0x68)
	{
		if(p8[7]==0x68)
		{
			if((p8[9]+12)==Len)
			{
				cs=0;
				for(i=0;i<(p8[9]+10);i++)
				{
					cs+=p8[i];
				}
				cs&=0xff;
				if(cs==p8[i])
				{//和校验正确
					if(p8[i+1]==0x16)
					{
						return 2;//1=DL/T645-1997,2=DL/T645-2007
					}
				}
			}
		}
	}
//DL376-2
	if(p8[0]==0x68)
	{
		x=(p8[1]+(p8[2]<<8));
		if(x==Len)
		{
			if(p8[x-1]==0x16)
			{
				if(x>=5)
				{
					x-=5;
					cs=0;
					for(i=0;i<x;i++)
					{
						cs+=p8[3+i];
					}
					cs&=0xff;
					if(cs==p8[3+i])
					{
						return 128;//128=DL376.2
					}
				}
			}
		}
	}

	return 0;//未知
}


u32 Uart_698_Rx(u32 PORTn)//UART_698接收;返回0没完成,1完成,2超时
{
	u32 i;
	u8 * p8fifo;
	u16 * p16fifo;
	u8 * p8rx;
	u16 * p16timer;
  UARTCtrl_TypeDef * UARTCtrl;

	u32 LEN_UARTnIntRx;
	u32 LEN_UARTnRx;
	u32 p0;
	u32 p1;
	u32 RxByte;
	u32 LEN_SA;//服务器地址SA的长度
	
  UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	LEN_UARTnIntRx=Get_LEN_UARTnIntRx(PORTn);
	p16timer=(u16 *)Get_ADDR_UARTnTimer(PORTn);
	
	p16fifo=(u16 *)Get_ADDR_UARTn(PORTn);
	DMA_UARTn_RX_Pointer(PORTn);//计算DMA_UARTn接收指针值(p0)
	p0=p16fifo[0];//中断接收指针
	p1=p16fifo[1];//当前已读指针
	if((p0>=(LEN_UARTnIntRx-10))||(p1>=(LEN_UARTnIntRx-10)))
	{
		p16fifo[0]=0;//中断接收指针
		p16fifo[1]=0;//当前已读指针
		p16fifo[2]=0;//规约检查指针
		p16fifo[3]=0;
		p16fifo[4]=0;
		return 0;//返回0没完成,1完成,2超时
	}
	RxByte=UARTCtrl->RxByte;
	if(p0!=p1)
	{//有数据接收,重置接收超时定时
		if(PORTn==RS485_1PORT)
		{
			Terminal_Ram->RS485_1_RxLED_MS_Timer=20/10;//11 RS485抄表接收LED指示MS定时器,每10MS减1定时器
		}
		if(PORTn==RS485_2PORT)
		{
			Terminal_Ram->RS485_2_RxLED_MS_Timer=20/10;//11 RS485抄表接收LED指示MS定时器,每10MS减1定时器
		}
		p8fifo=(u8 *)(Get_ADDR_UARTn(PORTn)+10);
	  p8rx=(u8 *)Get_ADDR_UARTnRx(PORTn);
		LEN_UARTnRx=Get_LEN_UARTnRx(PORTn);
		//被动接收超时定时从接收FIFO中有数据时开始定时,平时=0以便运行其他任务
		if(PORTn==ENETPORT)
		{
			p16timer[0]=5000/10;//以太网模块超时定时5S
		}
		else
		{
			if(PORTn==GPRSPORT)
			{
			#if (USER/100)==0//电科院测试
				p16timer[0]=5000/10;//无线通信模块超时定时5S
			#else
				p16timer[0]=10000/10;//无线通信模块超时定时10S
			#endif
			}
			else
			{
				if(PORTn==SMSPORT)
				{
					p16timer[0]=60000/10;//短信通道超时定时60S
				}
				else
				{
					p16timer[0]=2000/10;//其他通道1S
				}
			}
		}
	}
	while(p0!=p1)
	{
		if(RxByte>=LEN_UARTnRx)
		{
			RxByte=0;
		}
		i=p8fifo[p1];
		p1++;
		if(p1>=(LEN_UARTnIntRx-10))
		{
			p1=0;
		}
		p8rx[RxByte]=i;
		RxByte++;
		
		if(RxByte==1)
		{
			if(i!=0x68)
			{
				RxByte=0;
				continue;
			}
		}
		else
		{
			LEN_SA=p8rx[4];//取地址字节数
			LEN_SA&=0x0f;
			LEN_SA++;
			if(RxByte==(5+LEN_SA+3))
			{
				i=Uart_698_HCS(p8rx);//帧头校验计算;返回0=正确，1=错误
				if(i)
				{//校验错误
					RxByte-=1;
					while(1)
					{
						if(p1>=RxByte)
						{
							p1-=RxByte;
							break;
						}
						p1+=LEN_UARTnIntRx-10;
					}								
					RxByte=0;
					continue;
				}
			}
			if(RxByte>13)
			{
				if(RxByte>=(p8rx[1]+(p8rx[2]<<8)+2))
				{
					if(i==0x16)
					{//接收完成
						//校验计算
						i=Uart_698_HCSFCS(p8rx);//整帧校验计算(HCS和FCS),同时加结束0x16;返回0=正确，1=错误
						if(i)
						{//校验错误
							RxByte-=1;
							while(1)
							{
								if(p1>=RxByte)
								{
									p1-=RxByte;
									break;
								}
								p1+=LEN_UARTnIntRx-10;
							}								
							RxByte=0;
							continue;
						}
						//和校验正确
						p16fifo[1]=p1;//当前已读指针
						p16fifo[2]=p1;//检查指针==读指针,免检省时
						p16fifo[3]=p1;//检查指针==读指针,免检省时
						p16fifo[4]=p1;//检查指针==读指针,免检省时
						UARTCtrl->RxByte=RxByte;
						return 1;//返回0没完成,1完成,2超时
					}
					else
					{//结尾错
						RxByte-=1;
						while(1)
						{
							if(p1>=RxByte)
							{
								p1-=RxByte;
								break;
							}
							p1+=LEN_UARTnIntRx-10;
						}								
						RxByte=0;
						continue;
					}
				}
			}
		}
	}
	p16fifo[1]=p1;
	UARTCtrl->RxByte=RxByte;
	if(p16timer[0]==0x0)
	{//超时
		UARTCtrl->RxByte=0;//已接收字节数=0
		return 2;//返回0没完成,1完成,2超时
	}
	return 0;//返回0没完成,1完成,2超时
}


