gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_UART.cpp
#include "../DL698/DL698_JSON.h"


void Uart_698_RxTx(u32 PORTn)//UART_698接收发送
{
	u32 i;
	u32 x;
	u16* p16timer;
  UARTCtrl_TypeDef * UARTCtrl;
	ms_Type* ms;
	u32 LEN_UARTnTx;
	u32 LEN_ADDR;
	u32 LEN_TAPDU;
	u32 LEN_TxAPDU;
	u32 LEN_Tx;
	u8* p8tx;
	
	u8 * p8rx;
	u8 * p8data;
	u32 y;

	
  UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	p16timer=(u16 *)Get_ADDR_UARTnTimer_S(PORTn);//秒定时器

	if(p16timer[0]==0)
	{//释放我的内存堆分配秒定时
		if(UARTCtrl->pTxData)
		{
			ms=Get_ms();
			ms->ms_free(UARTCtrl->pTxData);
			UARTCtrl->pTxData=0;
		}
	}
	p16timer=(u16 *)Get_ADDR_UARTnTimer(PORTn);
	switch(UARTCtrl->Task)
	{
		case 0://0=正在接收
			if(UARTCtrl->Lock==0x55)
			{
				return;//0x55=通信功能正在被调用禁止其他程序再次调用
			}
			//组地址和广播地址时级连转发结束
/*
			i=UARTCtrl->CascadingBroadcast;//0=空,级联组或广播地址转发的端口号(RS485_1PORT,RS485_2PORT,RS485_3PORT)
			if(i!=0)
			{
				UARTCtrlRS485=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(i);
				if(UARTCtrlRS485->Lock==0x55)
				{
					if(UARTCtrlRS485->TxByte==0)//发送字节数(半字对齐)
					{
						UARTCtrl->CascadingBroadcast=0;//0=空,级联组或广播地址转发的端口号(RS485_1PORT,RS485_2PORT,RS485_3PORT)
						UARTCtrlRS485->Lock=0;
					}
				}
			}
*/
			if((PORTn==GPRSPORT)||(PORTn==ENETPORT))
			{
				if(UARTCtrl->ReNewLink==0x55)//0x55=通信参数变化当前帧发送完成后重新连接
				{
					UARTCtrl->ReNewLink=0;//0x55=通信参数变化当前帧发送完成后重新连接
					UARTCtrl->LinkTask=0;
					p16timer[0]=0;//延时关机
					return;
				}
			}
			//接收
			i=Uart_698_Rx(PORTn);//UART_698接收;返回0没完成,1完成,2超时
			if(i==1)
			{
				UARTCtrl->Task=1;
			}
			if(UARTCtrl->RxByte==0)
			{
				EVENT_REPORT_Notification(PORTn);//上报通知(事件)
				REPORT_Notification(PORTn);//上报通知(定时任务)
			}
			break;
		case 1://1=接收完成
			p8rx=(u8 *)Get_ADDR_UARTnRx(PORTn);
			if(p8rx[3]&(1<<5))//分帧标志位
			{
				if(p16timer[0]==0x0)
				{
					LEN_UARTnTx=Get_LEN_UARTnTx(PORTn);
					p8rx=(u8 *)Get_ADDR_UARTnRx(PORTn);
					p8tx=(u8 *)Get_ADDR_UARTnTx(PORTn);
					p8data=(u8 *)Get_ADDR_UARTnFnDataBuff(PORTn);
					LEN_ADDR=p8rx[4];//取地址字节数
					LEN_ADDR&=0x0f;
					LEN_ADDR++;
					LEN_ADDR+=2;
					LEN_TAPDU=11+LEN_ADDR;//除起始字符和结束字符之外的帧字节数
					LEN_TAPDU-=3+LEN_ADDR+2+2;//长度域L和控制域C=3byte,帧头校验=2byte,帧校验=2byte
					MR((u32)p8tx,(u32)p8rx,4+LEN_ADDR+2);
					p8tx[3]|=p8rx[3]|0x80;//分帧标志位
					LEN_Tx=4+LEN_ADDR+2;

					x=p8rx[LEN_Tx];//链路层分帧序号计数0-4095

					p8tx[LEN_Tx]=p8rx[LEN_Tx];
					p8tx[LEN_Tx+1]=(p8rx[LEN_Tx+1]&0x0f)|0x80;
					if((p8rx[LEN_Tx+1]&0xf0)==0x00)
					{
						p8data[6*1024]=0;
						p8data[6*1024+1]=0;
					}
					LEN_Tx+=2+1;
					UARTCtrl->TxByte=LEN_Tx+2;
					x=(p8rx[2]<<8|p8rx[1])-3-LEN_ADDR-4-2;
					y=(p8data[6*1024]<<8|p8data[6*1024+1]);
					MR((u32)p8data+2+y+6*1024,(u32)p8rx+16,x);
					p8data[6*1024+1]=(x+y)&0xff;
					p8data[6*1024]=((x+y)>>8)&0xff;
					
					if((p8rx[LEN_Tx-2]&0xf0)==0x40)
					{
						MR((u32)p8rx+4+LEN_ADDR+2,(u32)p8data+6*1024+2,x+y);
						LEN_Tx=4+LEN_ADDR+2+x+y+2-1;
						p8rx[3]=0x43;
						p8rx[1]=LEN_Tx;
						p8rx[2]=LEN_Tx>>8;
						Uart_698_HCSFCS(p8rx);
						UARTCtrl->Task=8;
						return;
					}
					p8tx[1]=LEN_Tx;
					p8tx[2]=LEN_Tx>>8;
					Uart_698_HCSFCS(p8tx);//整帧校验计算(HCS和FCS),同时加结束0x16;返回0=正确，1=错误
					
				#if LOG_68==1//0=没,1=有
					LOG(698,1,PORTn,(u8 *)Get_ADDR_UARTnTx(PORTn),UARTCtrl->TxByte,0);//入口:TR=0接收=1发送;protocol=13761,13762,13763,6451997,6452007;ascii=0为hex码=1本身为ascii码
				#endif
				#if DEBUG_698toRS232==1//0=否,1=是;调试:ENET口收发数据打印到RS232口
					LOGRS232(698,1,PORTn,(u8 *)Get_ADDR_UARTnTx(PORTn),UARTCtrl->TxByte,0);//入口:TR=0接收=1发送;protocol=13761,13762,13763,6451997,6452007;ascii=0为hex码=1本身为ascii码
				#endif
					if(PORTn!=GPRSPORT)
					{//GPRS另自计
						UARTCtrl->RxTxByte+=UARTCtrl->TxByte;
					}
					UARTCtrl->Task=2;//正在发送标志
				}
				else
				{
					if(p16timer[0]>(20/10))
					{//数据转发,返回err时没重置定时值!
						p16timer[0]=20/10;
					}
				}
				break;
			}
			if(UARTCtrl->Lock==0x55)
			{
				return;//0x55=通信功能正在被调用禁止其他程序再次调用
			}
			UARTCtrl->Task=0;//0=接收
			UARTCtrl->AddrType=0;//接收帧的地址类型:0=空,1=单地址,2=组地址,3=广播地址
//			UARTCtrl->TxFrameCount=0;//寄存多帧数据时已发送帧计数
//			UARTCtrl->MulFrameGPCR=0;//多帧时通用计数寄存器
//			UARTCtrl->LockFlags&=(~(7<<4));//通信功能被禁止标志:B0=保留,B1=正在自动搜表,B2=本日已自动搜表,B3=保留,B4=主动1类定时任务,B5=主动2类定时任务,B6=召读1类定时任务,B7
			UARTCtrl->SubTask=0;//子任务(临时操作路由模块任务计数,在每帧接收OK时初始化为0)
			//接收-发送延时
			if((PORTn==ENETPORT)||(PORTn==GPRSPORT)||(PORTn==SMSPORT))
			{//ENET,GPRS或短信通道
				p16timer[0]=0;//延时0MS发送
			}
			else
			{//RS232,RS485
				p16timer[0]=20/10;//延时xMS发送(两帧之间的线路空闲间隔最少需33位)
			}
			if((PORTn==GPRSPORT)||(PORTn==ENETPORT))
			{//通信模块
				//清心跳定时(正确收到任何帧,清心跳定时)
				if(PORTn==GPRSPORT)
				{
					i=(u32)Get_Element((u8*)ADDR_4500_2,12,0,LENmax_4500_2);//计算元素地址,使用ADDR_128K_DATABUFF
				}
				else
				{
					i=(u32)Get_Element((u8*)ADDR_4510_2,8,0,LENmax_4510_2);//计算元素地址,使用ADDR_128K_DATABUFF
				}
				if(i==0)
				{
					i=120;
				}
				else
				{
					i=MRR(i+1,2);
					i=(i>>8)+((i&0xff)<<8);
				}
				
				if((UARTCtrl->TCPUDP&0x30)==0x20)//原工作模式(同F8设置字)B7=0TCP=1UDP,B6=,B5-B4=0混合模式=1客户机模式=2服务器模式,B3-B0=其它
				{//是服务器模式
					i+=60;//加60秒可能的主站心跳发出定时误差
				}
				if(PORTn==GPRSPORT)
				{
					Terminal_Ram->GPRSHeartBeat_S_Timer=i;//GPRS心跳秒定时器
					if(UARTCtrl->HostACK<=1)//主动上报需主站确认帧标记:0=无,1=登录帧,2=退出登录帧,3=心跳帧,4=重要事件,5=定时任务
					{
/*
						i=MRR(ADDR_AFN04F8+4,1);
						if(i==0x0)
						{
							i=1;//最小被动激活模式连续无通信自动断线时间1分
						}
						i*=60;
						Terminal_Ram->GPRSAutoDiscon_S_Timer=i;//GPRS被动激活模式连续无通信自动断线秒定时器
*/
					}
				}
				if(PORTn==ENETPORT)
				{
					Terminal_Ram->ENETHeartBeat_S_Timer=i;//以太网心跳秒定时器
				}
			#if (Project/100)==3//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
				//清自动保电允许与主站连续无通信时间分定时器
				i=MRR(ADDR_8001_3+1,2);
				i=(i>>8)|((i&0xff)<<8);
				if(i==0)
				{//0表示不自动保电
					i=60;
				}
				Terminal_Ram->DisconAutoProtect_M_Timer=i;//1 自动保电允许与主站连续无通信时间分定时器
			#endif
			#if (Project/100)==4//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
				//清自动保电允许与主站连续无通信时间分定时器
				if(Comm_Ram->MODE3in1==0)//三合一终端当前运行模式:0=专变,1=集中器
				{
					i=MRR(ADDR_8001_3+1,2);
					i=(i>>8)|((i&0xff)<<8);
					if(i==0)
					{//0表示不自动保电
						i=60;
					}
					Terminal_Ram->DisconAutoProtect_M_Timer=i;//1 自动保电允许与主站连续无通信时间分定时器
				}
			#endif
			}
			if(PowerEvent->task!=100)
			{
				Comm_Ram->BattWork_S_timer=60;//4 电池工作关机秒定时器
			}
		#if LOG_698==1//0=没,1=有
			LOG(698,0,PORTn,(u8 *)Get_ADDR_UARTnRx(PORTn),UARTCtrl->RxByte,0);//入口:TR=0接收=1发送;protocol=13761,13762,13763,6451997,6452007;ascii=0为hex码=1本身为ascii码
		#endif
		#if DEBUG_698toRS232==1//0=否,1=是;调试:ENET口收发数据打印到RS232口
			LOGRS232(698,0,PORTn,(u8 *)Get_ADDR_UARTnRx(PORTn),UARTCtrl->RxByte,0);//入口:TR=0接收=1发送;protocol=13761,13762,13763,6451997,6452007;ascii=0为hex码=1本身为ascii码
		#endif
			if(PORTn!=GPRSPORT)
			{//GPRS另自计
				UARTCtrl->RxTxByte+=UARTCtrl->RxByte;
			}
//		#if (USER/100)==0//电科院测试
			Uart_698_Data(PORTn,0);//UART_698数据;入口:安全模式SECURITY=0不启用=1启用
		#if((Project/100)==2)||((Project/100)==4)
			if(UARTCtrl->Lock_InfoTask==0x55)//读路由网络拓扑信息等任务:0x55=锁定
			{
				UARTCtrl->Task=1;
				break;
			}
		#endif
//		#else
//			i=MRR(ADDR_F101_2+1,1);//安全模式参数
//			if(i)
//			{
//				Uart_698_Data(PORTn,1);//UART_698数据;入口:安全模式SECURITY=0不启用=1启用
//			}
//			else
//			{
//				Uart_698_Data(PORTn,0);//UART_698数据;入口:安全模式SECURITY=0不启用=1启用
//			}
//		#endif
			UARTCtrl->RxByte=0;//rx计数=0
			break;
		case 2://2=等待单帧数据发送
			if((PORTn==ENETPORT)||(PORTn==GPRSPORT))
			{
				break;
			}
			if(p16timer[0]==0x0)
			{
//				LEN_UARTnTx=Get_LEN_UARTnTx(PORTn);
//				p8tx=(u8 *)Get_ADDR_UARTnTx(PORTn);
//				LEN_ADDR=p8tx[4];//取地址字节数
//				LEN_ADDR&=0x0f;
//				LEN_ADDR++;
//				LEN_ADDR+=2;
//				LEN_TAPDU=p8tx[1]+(p8tx[2]<<8);//除起始字符和结束字符之外的帧字节数
//				LEN_TAPDU-=3+LEN_ADDR+2+2;
				LEN_TAPDU=0;//RS232,RS485链路层不分帧
				if(LEN_TAPDU<=LENmax_TxAPDU)//链路层分帧发送，每帧最大APDU字节数
				{
				#if LOG_698==1//0=没,1=有
					LOG(698,1,PORTn,(u8 *)Get_ADDR_UARTnTx(PORTn),UARTCtrl->TxByte,0);//入口:TR=0接收=1发送;protocol=13761,13762,13763,6451997,6452007;ascii=0为hex码=1本身为ascii码
				#endif
				#if DEBUG_698toRS232==1//0=否,1=是;调试:ENET口收发数据打印到RS232口
					LOGRS232(698,1,PORTn,(u8 *)Get_ADDR_UARTnTx(PORTn),UARTCtrl->TxByte,0);//入口:TR=0接收=1发送;protocol=13761,13762,13763,6451997,6452007;ascii=0为hex码=1本身为ascii码
				#endif
					if(PORTn!=GPRSPORT)
					{//GPRS另自计
						UARTCtrl->RxTxByte+=UARTCtrl->TxByte;
					}
					UARTCtrl->Task=3;//正在发送标志
					Start_UARTn_Tx(PORTn);//启动UART口发送
				}
				else
				{
					p8tx=(u8 *)Get_ADDR_UARTnTx(PORTn);
					MW((u32)p8tx,(u32)p8tx+LEN_UARTnTx,UARTCtrl->TxByte);
					UARTCtrl->TxAPDUSEQ=0;//链路层分帧序号计数0-4095
					UARTCtrl->TxAPDUByte=0;//链路层分帧已发送APDU字节数
					UARTCtrl->Task=5;//5=等待链路层分帧数据发送
				}
			}
			else
			{
				if(p16timer[0]>(200/10))
				{//数据转发,返回err时没重置定时值!
					p16timer[0]=200/10;
				}
			}
			break;
		case 3://3=单帧数据正在发送
			if(Wait_UARTn_Tx(PORTn)==0)//等待UART口发送,返回0=发送完成,1=发送没完成
			{			
				UARTCtrl->Task=0;//0=正在接收
				UARTCtrl->RxByte=0;//rx计数=0
				p16timer[0]=0;//超时定时=0;接收超时定时从接收FIFO中有数据时开始定时,平时=0以便运行其他任务
			}
			break;
			
		case 4://4=多帧数据续接收完成
			//接收-发送延时
			if((PORTn==ENETPORT)||(PORTn==GPRSPORT)||(PORTn==SMSPORT))
			{//ENET,GPRS或短信通道
				p16timer[0]=0;//延时0MS发送
			}
			else
			{//RS232,RS485
				p16timer[0]=20/10;//延时?MS发送(两帧之间的线路空闲间隔最少需33位)
			}
//		#if (USER/100)==0//电科院测试
			Uart_698_Data(PORTn,0);//UART_698数据;入口:安全模式SECURITY=0不启用=1启用
		#if((Project/100)==2)||((Project/100)==4)
			if(UARTCtrl->Lock_InfoTask==0x55)//读路由网络拓扑信息等任务:0x55=锁定
			{
				UARTCtrl->Task=4;
				break;
			}
		#endif
//		#else
//			i=MRR(ADDR_F101_2+1,1);//安全模式参数
//			if(i)
//			{
//				Uart_698_Data(PORTn,1);//UART_698数据;入口:安全模式SECURITY=0不启用=1启用
//			}
//			else
//			{
//				Uart_698_Data(PORTn,0);//UART_698数据;入口:安全模式SECURITY=0不启用=1启用
//			}
//		#endif
			UARTCtrl->RxByte=0;//rx计数=0
			break;
		case 5://5=等待链路层分帧数据发送
			if((PORTn==ENETPORT)||(PORTn==GPRSPORT))
			{
				break;
			}
			if(p16timer[0]==0x0)
			{
				LEN_UARTnTx=Get_LEN_UARTnTx(PORTn);
				p8tx=(u8 *)Get_ADDR_UARTnTx(PORTn);
				LEN_ADDR=p8tx[4];//取地址字节数
				LEN_ADDR&=0x0f;
				LEN_ADDR++;
				LEN_ADDR+=2;
				LEN_TAPDU=p8tx[LEN_UARTnTx+1]+(p8tx[LEN_UARTnTx+2]<<8);//除起始字符和结束字符之外的帧字节数
				LEN_TAPDU-=3+LEN_ADDR+2+2;//长度域L和控制域C=3byte,帧头校验=2byte,帧校验=2byte
				MR((u32)p8tx,(u32)p8tx+LEN_UARTnTx,4+LEN_ADDR+2);
				p8tx[3]|=(1<<5);//分帧标志位
				LEN_Tx=4+LEN_ADDR+2;
				i=UARTCtrl->TxAPDUByte;
				if(i>=LEN_TAPDU)
				{
					UARTCtrl->RxByte=0;//rx计数=0
					UARTCtrl->Task=0;//0=接收
					return;
				}
				LEN_TxAPDU=LEN_TAPDU-i;
			//分帧格式域定义
			//bit0~bit11：表示分帧传输过程的帧序号，取值范围0~4095，循环使用；
			//bit12~bit13：保留；
			//bit15=0，bit14=0：表示分帧传输数据起始帧；
			//bit15=1，bit14=0：表示分帧传输确认帧（确认帧不包含APDU片段域）；
			//bit15=0，bit14=1：表示分帧传输最后帧；
			//bit15=1，bit14=1：表示分帧传输中间帧。
				x=UARTCtrl->TxAPDUSEQ;//链路层分帧序号计数0-4095
				UARTCtrl->TxAPDUSEQ++;//链路层分帧序号计数0-4095
				x&=0x7ff;
				if(UARTCtrl->TxAPDUByte==0)
				{//第1帧
					LEN_TxAPDU=LENmax_TxAPDU;
				}
				else
				{
					if(LEN_TxAPDU>LENmax_TxAPDU)//链路层分帧发送，每帧最大APDU字节数
					{//中间帧
						x|=0xC000;
						LEN_TxAPDU=LENmax_TxAPDU;
					}
					else
					{//最后帧
						x|=0x4000;
					}
				}
				p8tx[LEN_Tx]=x;
				p8tx[LEN_Tx+1]=x>>8;
				LEN_Tx+=2;
				MR((u32)p8tx+LEN_Tx,(u32)p8tx+LEN_UARTnTx+4+LEN_ADDR+2+UARTCtrl->TxAPDUByte,LEN_TxAPDU);
				UARTCtrl->TxAPDUByte+=LEN_TxAPDU;
				LEN_Tx+=LEN_TxAPDU;
				LEN_Tx+=2+1;
				UARTCtrl->TxByte=LEN_Tx;
				LEN_Tx-=2;
				p8tx[1]=LEN_Tx;
				p8tx[2]=LEN_Tx>>8;
				Uart_698_HCSFCS(p8tx);//整帧校验计算(HCS和FCS),同时加结束0x16;返回0=正确，1=错误
				
			#if LOG_68==1//0=没,1=有
				LOG(698,1,PORTn,(u8 *)Get_ADDR_UARTnTx(PORTn),UARTCtrl->TxByte,0);//入口:TR=0接收=1发送;protocol=13761,13762,13763,6451997,6452007;ascii=0为hex码=1本身为ascii码
			#endif
			#if DEBUG_698toRS232==1//0=否,1=是;调试:ENET口收发数据打印到RS232口
				LOGRS232(698,1,PORTn,(u8 *)Get_ADDR_UARTnTx(PORTn),UARTCtrl->TxByte,0);//入口:TR=0接收=1发送;protocol=13761,13762,13763,6451997,6452007;ascii=0为hex码=1本身为ascii码
			#endif
				if(PORTn!=GPRSPORT)
				{//GPRS另自计
					UARTCtrl->RxTxByte+=UARTCtrl->TxByte;
				}
				UARTCtrl->Task=6;//正在发送标志
				Start_UARTn_Tx(PORTn);//启动UART口发送
			}
			else
			{
				if(p16timer[0]>(20/10))
				{//数据转发,返回err时没重置定时值!
					p16timer[0]=20/10;
				}
			}
			break;
		case 6://6=链路层分帧正在发送
			if(Wait_UARTn_Tx(PORTn)==0)//等待UART口发送,返回0=发送完成,1=发送没完成
			{
				UARTCtrl->RxByte=0;//rx计数=0
				p16timer[0]=0;//超时定时=0;接收超时定时从接收FIFO中有数据时开始定时,平时=0以便运行其他任务
				
				UARTCtrl->Task=0;
			}
			break;
		case 7://7=等待发送器空转为接收
			UARTCtrl->Task=0;//0=正在接收
			UARTCtrl->RxByte=0;//rx计数=0
			p16timer[0]=0;//超时定时=0;接收超时定时从接收FIFO中有数据时开始定时,平时=0以便运行其他任务
			break;		
		case 8:
			if(UARTCtrl->Lock==0x55)
			{
				return;//0x55=通信功能正在被调用禁止其他程序再次调用
			}
			UARTCtrl->Task=0;//0=接收
			UARTCtrl->AddrType=0;//接收帧的地址类型:0=空,1=单地址,2=组地址,3=广播地址
//			UARTCtrl->TxFrameCount=0;//寄存多帧数据时已发送帧计数
//			UARTCtrl->MulFrameGPCR=0;//多帧时通用计数寄存器
//			UARTCtrl->LockFlags&=(~(7<<4));//通信功能被禁止标志:B0=保留,B1=正在自动搜表,B2=本日已自动搜表,B3=保留,B4=主动1类定时任务,B5=主动2类定时任务,B6=召读1类定时任务,B7
			UARTCtrl->SubTask=0;//子任务(临时操作路由模块任务计数,在每帧接收OK时初始化为0)
			//接收-发送延时
			if((PORTn==ENETPORT)||(PORTn==GPRSPORT)||(PORTn==SMSPORT))
			{//ENET,GPRS或短信通道
				p16timer[0]=0;//延时0MS发送
			}
			else
			{//RS232,RS485
				p16timer[0]=20/10;//延时xMS发送(两帧之间的线路空闲间隔最少需33位)
			}
			if((PORTn==GPRSPORT)||(PORTn==ENETPORT))
			{//通信模块
				//清心跳定时(正确收到任何帧,清心跳定时)
				if(PORTn==GPRSPORT)
				{
					i=(u32)Get_Element((u8*)ADDR_4500_2,12,0,LENmax_4500_2);//计算元素地址,使用ADDR_128K_DATABUFF
				}
				else
				{
					i=(u32)Get_Element((u8*)ADDR_4510_2,8,0,LENmax_4510_2);//计算元素地址,使用ADDR_128K_DATABUFF
				}
				if(i==0)
				{
					i=120;
				}
				else
				{
					i=MRR(i+1,2);
					i=(i>>8)+((i&0xff)<<8);
				}
				
				if((UARTCtrl->TCPUDP&0x30)==0x20)//原工作模式(同F8设置字)B7=0TCP=1UDP,B6=,B5-B4=0混合模式=1客户机模式=2服务器模式,B3-B0=其它
				{//是服务器模式
					i+=60;//加60秒可能的主站心跳发出定时误差
				}
				if(PORTn==GPRSPORT)
				{
					Terminal_Ram->GPRSHeartBeat_S_Timer=i;//GPRS心跳秒定时器
					if(UARTCtrl->HostACK<=1)//主动上报需主站确认帧标记:0=无,1=登录帧,2=退出登录帧,3=心跳帧,4=重要事件,5=定时任务
					{
/*
						i=MRR(ADDR_AFN04F8+4,1);
						if(i==0x0)
						{
							i=1;//最小被动激活模式连续无通信自动断线时间1分
						}
						i*=60;
						Terminal_Ram->GPRSAutoDiscon_S_Timer=i;//GPRS被动激活模式连续无通信自动断线秒定时器
*/
					}
				}
				if(PORTn==ENETPORT)
				{
					Terminal_Ram->ENETHeartBeat_S_Timer=i;//以太网心跳秒定时器
				}
			#if (Project/100)==3//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
				//清自动保电允许与主站连续无通信时间分定时器
				i=MRR(ADDR_8001_3+1,2);
				i=(i>>8)|((i&0xff)<<8);
				if(i==0)
				{//0表示不自动保电
					i=60;
				}
				Terminal_Ram->DisconAutoProtect_M_Timer=i;//1 自动保电允许与主站连续无通信时间分定时器
			#endif
			#if (Project/100)==4//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
				//清自动保电允许与主站连续无通信时间分定时器
				if(Comm_Ram->MODE3in1==0)//三合一终端当前运行模式:0=专变,1=集中器
				{
					i=MRR(ADDR_8001_3+1,2);
					i=(i>>8)|((i&0xff)<<8);
					if(i==0)
					{//0表示不自动保电
						i=60;
					}
					Terminal_Ram->DisconAutoProtect_M_Timer=i;//1 自动保电允许与主站连续无通信时间分定时器
				}
			#endif
			}
			if(PowerEvent->task!=100)
			{
				Comm_Ram->BattWork_S_timer=60;//4 电池工作关机秒定时器
			}
		#if LOG_698==1//0=没,1=有
			LOG(698,0,PORTn,(u8 *)Get_ADDR_UARTnRx(PORTn),UARTCtrl->RxByte,0);//入口:TR=0接收=1发送;protocol=13761,13762,13763,6451997,6452007;ascii=0为hex码=1本身为ascii码
		#endif
		#if DEBUG_698toRS232==1//0=否,1=是;调试:ENET口收发数据打印到RS232口
			LOGRS232(698,0,PORTn,(u8 *)Get_ADDR_UARTnRx(PORTn),UARTCtrl->RxByte,0);//入口:TR=0接收=1发送;protocol=13761,13762,13763,6451997,6452007;ascii=0为hex码=1本身为ascii码
		#endif
			if(PORTn!=GPRSPORT)
			{//GPRS另自计
				UARTCtrl->RxTxByte+=UARTCtrl->RxByte;
			}
//		#if (USER/100)==0//电科院测试
			i=MRR(ADDR_F101_2+1,1);//安全模式参数
			if(i)
			{
				Uart_698_Data(PORTn,1);//UART_698数据;入口:安全模式SECURITY=0不启用=1启用
			}
			else
			{
				Uart_698_Data(PORTn,0);//UART_698数据;入口:安全模式SECURITY=0不启用=1启用
			}
//			Uart_698_Data(PORTn,1);//UART_698数据;入口:安全模式SECURITY=0不启用=1启用
		#if((Project/100)==2)||((Project/100)==4)
			if(UARTCtrl->Lock_InfoTask==0x55)//读路由网络拓扑信息等任务:0x55=锁定
			{
				UARTCtrl->Task=1;
				break;
			}
		#endif
//		#else
//			i=MRR(ADDR_F101_2+1,1);//安全模式参数
//			if(i)
//			{
//				Uart_698_Data(PORTn,1);//UART_698数据;入口:安全模式SECURITY=0不启用=1启用
//			}
//			else
//			{
//				Uart_698_Data(PORTn,0);//UART_698数据;入口:安全模式SECURITY=0不启用=1启用
//			}
//		#endif
			UARTCtrl->RxByte=0;//rx计数=0
			break;
		default:
			UARTCtrl->Task=0;//0=正在接收
			break;
	}
}

void Uart_698_Data(u32 PORTn,u32 SECURITY)//UART_698数据;入口:安全模式SECURITY=0不启用=1启用
{
	u32 i;
	u32 x;
	u32 LEN_SA;
	u32 LEN_RxAPDU;
	u8 * p8rx;
  UARTCtrl_TypeDef * UARTCtrl;
	ms_Type *ms;
	u8* p8;
	u32 DataAdd33;
	
