gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_UART.cpp
  UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
  p8rx=(u8 *)Get_ADDR_UARTnRx(PORTn);
	if(p8rx[3]&0x80)//控制域C,bit7=传输方向位：DIR=0表示此帧是由客户机发出的,DIR=1表示此帧是由服务器发出的;bit6=启动标志位：PRM=1表示此帧是由客户机发起的；PRM=0表示此帧是由服务器发起的;bit5=分帧标志位
	{//非主站下行帧
		return;
	}
	LEN_RxAPDU=p8rx[1]+(p8rx[2]<<8);//除起始字符和结束字符之外的帧字节数
	LEN_SA=p8rx[4];//取地址字节数
	LEN_SA&=0x0f;
	LEN_SA++;
	if(LEN_RxAPDU<(LEN_SA+8+1+2))
	{
		return;//长度错
	}
	i=p8rx[4];
//#if (USER/100)==0//电科院测试
	if((i&0x30)==0x30)
	{
		return;//bit4…bit5逻辑地址=3；电科院一致性测试时认为错，功能测试软件测试电压合格率时用逻辑地址1其他测试用逻辑地址0
	}
//#endif
	i>>=6;
	switch(i)//bit6…bit7：为地址域服务器地址的类别标志，采用编码方式，0表示单地址，1表示通配地址，2表示组地址，3表示广播地址
	{
		case 0://0表示单地址
		case 1://1表示通配地址
			if(PORTn!=ACSAMPLEPORT)
			{
				i=Uart_TSA_Comp(p8rx+4,(u8 *)ADDR_4001+1);//通信地址比较,pFLASH数据读到ADDR_128K_DDATABUFF中比较,返回:0=相同,!=0不相同
				if(i)
				{
					return;//地址不同
				}
				i=p8rx[4];
				i&=0x0f;
				i++;
				MR((u32)p8rx+4+1,ADDR_128KDATABUFF+1,i);
			}
			UARTCtrl->AddrType=1;//接收帧的地址类型:0=空,1=单地址,2=组地址,3=广播地址
			break;
		case 2://2表示组地址
//68 xx 00 43 LEN_SA 01 02 03 10 FF FF 06 01 02 40 00 02 00 1c 07 e1 07 0d 0f 38 06 00 1c 43 16
			//剔除投入
			i=MRR(ADDR_4024+1,1);//属性2∷=enum {剔除投入（1），剔除解除（2）}
			if(i==1)
			{//剔除投入,只有对时命令继续有效,其他全部无效
				i=(p8rx[5+LEN_SA+3]<<8)|p8rx[5+LEN_SA+4];
				if(i!=0x0601)
				{//
					return;
				}
				i=(p8rx[5+LEN_SA+6]<<24)|(p8rx[5+LEN_SA+7]<<16)|(p8rx[5+LEN_SA+8]<<8)|p8rx[5+LEN_SA+9];
				if(i!=0x40000200)
				{//!对时命令
					return;
				}
			}
			MR(ADDR_DATABUFF,ADDR_4005,LENmax_4005);
			p8=(u8*)ADDR_DATABUFF;
			x=p8[1];//数组数
			p8+=2;
			for(i=0;i<x;i++)
			{
				LEN_RxAPDU=Uart_TSA_Comp(p8rx+4,p8+1);//通信地址比较,pFLASH数据读到ADDR_128K_DDATABUFF中比较,返回:0=相同,!=0不相同
				if(LEN_RxAPDU==0)
				{//相同
					break;
				}
				p8+=Get_DL698DataLen_S(p8,0);//得到DL698数据类型长度(包括:类型字节和数据);
			}
			if(i>=x)
			{
				return;//地址不同
			}
			UARTCtrl->AddrType=2;//接收帧的地址类型:0=空,1=单地址,2=组地址,3=广播地址
			break;
		case 3://3表示广播地址
			//只有广播校时和读通信地址时有效
//68 xx 00 43 00 AA 10 FF FF 05 01 00 40 01 02 00 00 XX XX 16
//68 xx 00 43 00 AA 10 FF FF 07 01 01 40 00 7F 00 1C yy yy mm dd hh mm ss 00 XX XX 16
//68 xx 00 43 00 AA 10 FF FF 06 01 02 40 00 02 00 1c 07 e1 07 0d 0f 38 06 00 1c 43 16
			i=(p8rx[9]<<8)|p8rx[10];
			switch(i)
			{
				case 0x0501://读通信地址
					i=(p8rx[12]<<24)|(p8rx[13]<<16)|(p8rx[14]<<8)|p8rx[15];
					if(i==0x40010200)
					{
						break;
					}
					return;
				default:
					//剔除投入
					i=MRR(ADDR_4024+1,1);//属性2∷=enum {剔除投入（1），剔除解除（2）}
					if(i==1)
					{//剔除投入,只有对时命令继续有效,其他全部无效
						i=(p8rx[9]<<8)|p8rx[10];
						if(i!=0x0601)
						{//
							return;
						}
						i=(p8rx[12]<<24)|(p8rx[13]<<16)|(p8rx[14]<<8)|p8rx[15];
						if(i!=0x40000200)
						{//!对时命令
							return;
						}
					}
					break;
			}
			UARTCtrl->AddrType=3;//接收帧的地址类型:0=空,1=单地址,2=组地址,3=广播地址
			break;
	}

	if(p8rx[3]&0x08)//扰码标志位 SC
	{
		//68 17 00 4B 05 02 00 00 00 00 00 10 82 21 38 34 48 73 33 35 33 33 38 78 16 
		DataAdd33=1;
		LEN_RxAPDU=p8rx[1]+(p8rx[2]<<8);//除起始字符和结束字符之外的帧字节数
		i=4+LEN_SA+3+2;
		if(LEN_RxAPDU>=i)
		{
			LEN_RxAPDU-=i;
		}
		else
		{
			LEN_RxAPDU=0;
		}
		for(i=0;i<LEN_RxAPDU;i++)
		{
			p8rx[5+LEN_SA+3+i]-=0x33;
		}
	}
	else
	{
		DataAdd33=0;
	}
	
	if(p8rx[3]&(1<<5))//分帧标志位
	{
		//分帧传输确认
		UARTCtrl->Task=5;//5=等待链路层分帧数据发送
		return;
	}
	UARTCtrl->Lock=0x55;//禁止线程再次调用
	switch(p8rx[3]&0x7)//应用层功能码
	{
		//0	保留	
		case 1://	链路管理	链路连接管理（登录，心跳，退出登录）
//LINK-APDU∷=CHOICE
//{
//  预连接请求	     [1]		LINK-Request，
//预连接响应       [129]	LINK-Response
//}
			i=p8rx[LEN_SA+8];
			if(i==129)//预连接响应       [129]	LINK-Response
			{
				LINK_Response(PORTn);
			}
			break;
		//2	保留	
		case 3://	用户数据	应用连接管理及数据交换服务
//客户机应用层协议数据单元（Client-APDU）
//Client-APDU∷=SEQUENCE
//{
//  应用层服务  CHOICE
//  {
//    建立应用连接请求	 [2]		CONNECT-Request，
//    断开应用连接请求	 [3]		RELEASE-Request，
//    读取请求			 [5]		GET-Request，
//    设置请求 			 [6]		SET-Request，
//    操作请求 			 [7]		ACTION-Request，
//    上报应答 			 [8]		REPORT-Response，
//    代理请求   		 [9]		PROXY-Request
//}，
//时间标签    TimeTag  OPTIONAL
//}
			i=p8rx[LEN_SA+8];
			switch(i)
			{
				case 2://建立应用连接请求	 [2]		CONNECT-Request，
					UARTCtrl->NEXT=0;//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
					CONNECT_Request(PORTn);//连接
					break;
				case 3://断开应用连接请求	 [3]		RELEASE-Request，
					UARTCtrl->NEXT=0;//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
					RELEASE_Request(PORTn);//断开
					break;
				case 5://读取请求			 [5]		GET-Request，
					GET_Request(PORTn);
					break;
				case 6://设置请求 			 [6]		SET-Request，
					UARTCtrl->NEXT=0;//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
					if(SECURITY==0)//安全模式SECURITY=0不启用=1启用
					{
						SET_Request(PORTn);
					}
					break;
				case 7://操作请求 			 [7]		ACTION-Request，
					UARTCtrl->NEXT=0;//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
					if(SECURITY==0)//安全模式SECURITY=0不启用=1启用
					{
						ACTION_Request(PORTn);
					}
					break;
				case 8://上报应答 			 [8]		REPORT-Response，
					UARTCtrl->NEXT=0;//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
					REPORT_Response(PORTn);
					break;
				case 9://代理请求   		 [9]		PROXY-Request
					if(UARTCtrl->REPORT_NUMmax)//若主站没应答最大还需重发上报次数,每上报1次减1
					{
						break;//有主动上报正在进行，放弃代理请求，因主动上报帧也存在UARTnFnDataBuff
					}
					if(SECURITY==0)//安全模式SECURITY=0不启用=1启用
					{
						PROXY_Request(PORTn);
					}
					break;
				case 16://安全请求   		[16]		SECURITY-Request
					SECURITY_Request(PORTn);//安全请求
					UARTCtrl->SECURITY_Request=0;//安全请求:b7=0无安全=1安全传输,b6=0明文=1密文,b5=,b4=,b3-b0=0数据验证码[0]SID_MAC =1随机数[1]RN =2随机数+数据MAC[2]RN_MAC =3安全标识[3]SID
					break;
				case 144://安全响应   		[144]	SECURITY-Response
					SECURITY_Response(PORTn);//安全响应
					break;
			}
			
			break;
		//4…7	保留	
	}
	UARTCtrl->Lock=0;//解除线程再次调用
	if(UARTCtrl->AddrType!=1)//接收帧的地址类型:0=空,1=单地址,2=组地址,3=广播地址
	{
		if(UARTCtrl->AddrType==3)//接收帧的地址类型:0=空,1=单地址,2=组地址,3=广播地址
		{
			i=(p8rx[12]<<24)|(p8rx[13]<<16)|(p8rx[14]<<8)|p8rx[15];
			if(i==0x40010200)
			{//是读通信地址
				return;
			}
		}
		UARTCtrl->Task=0;//无需回答
		if(UARTCtrl->pTxData)//需发送数据缓冲指针(动态分配),分段组织,每段前有2字节段长度
		{
			ms=Get_ms();
			ms->ms_free(UARTCtrl->pTxData);
			UARTCtrl->pTxData=0;
		}
		return;
	}
	if(DataAdd33)
	{
		p8rx=(u8 *)Get_ADDR_UARTnTx(PORTn);
		p8rx[3]|=0x08;//扰码标志位 SC
		LEN_RxAPDU=p8rx[1]+(p8rx[2]<<8);//除起始字符和结束字符之外的帧字节数
		i=4+LEN_SA+3+2;
		if(LEN_RxAPDU>=i)
		{
			LEN_RxAPDU-=i;
		}
		else
		{
			LEN_RxAPDU=0;
		}
		for(i=0;i<LEN_RxAPDU;i++)
		{
			p8rx[5+LEN_SA+3+i]+=0x33;
		}
		Uart_698_HCSFCS(p8rx);//整帧校验计算(HCS和FCS),同时加结束0x16;返回0=正确，1=错误
	}
}



u32 Uart_TSA_Comp(u8 *p8rx,u8 *pFLASH)//通信地址比较,pFLASH数据读到ADDR_128K_DDATABUFF中比较,返回:0=相同,!=0不相同
{
	u32 i;
	
	i=p8rx[0];
	i&=0x0f;
	i++;
	MR(ADDR_128KDATABUFF,(u32)pFLASH,i+1);
	Data_Inverse(ADDR_128KDATABUFF+1,i);//数据倒序(高低字节调换),入口Le>=2
	pFLASH=(u8*)ADDR_128KDATABUFF;
	if(i!=pFLASH[0])
	{
		return 1;
	}
	while(i--)
	{
		p8rx++;
		pFLASH++;
		if((p8rx[0]&0x0f)!=0x0a)
		{
			if((p8rx[0]&0x0f)!=(pFLASH[0]&0x0f))
			{
				return 1;
			}
		}
		if((p8rx[0]&0xf0)!=0xa0)
		{
			if((p8rx[0]&0xf0)!=(pFLASH[0]&0xf0))
			{
				return 1;
			}
		}
	}
	return 0;
}


u32 Uart_698_TxHead(u8 *p8tx,u32 C,u32 CA)//Uart698帧头填入发送缓冲区,入口:C=控制域,CA=客户机地址;返回:帧头长度
{
	u32 Len;
	
	
//起始字符（68H）  1Byte
	p8tx[0]=0x68;
//长度域L  2Byte(除起始字符和结束字符之外的帧字节数)
//控制域C  1Byte
	p8tx[3]=C;
//地址域A
	//地址标识AF  1Byte(bit0…bit3：为地址域服务器地址的字节数，采用编码方式，取值范围：0…15，对应表示1…16个字节长度)
	//服务器地址SA  可变
	MR(((u32)p8tx)+4,ADDR_4001+1,17);
	Len=p8tx[4];
	if(Len>16)
	{
		Len=16;
	}
	if(Len==0)
	{
		Len=1;
	}
	Data_Inverse((u32)p8tx+5,Len);//数据倒序(高低字节调换),入口Le>=2
	p8tx[4]=Len-1;
	//客户机地址CA  1Byte
	p8tx[5+Len]=CA;
//帧头校验HCS  2Byte(帧头校验HCS为2字节，是对帧头部分除起始字符和HCS本身之外的所有字节的校验)
	
	Len+=8;
	return Len;
	
