gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_UART.cpp
}

void Uart_698_TxResponse(u32 PORTn,u32 TI,u32 LEN_TxAPDU)//DL698发送响应数据,数据已在p8tx+TxAPDUOffset的开始地址中
{
	u32 i;
	u32 x;
	UARTCtrl_TypeDef * UARTCtrl;
	u8 * p8rx;
	u8 * p8tx;
	u16* p16;

	if(LEN_TxAPDU==0)
	{
		return;
	}
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	p8rx=(u8 *)Get_ADDR_UARTnRx(PORTn);
	p8tx=(u8 *)Get_ADDR_UARTnTx(PORTn);
	p8tx+=TxAPDUOffset;//TxAPDU存放开始地址
	
//上报信息FollowReport OPTIONAL=0 表示没有
	p8tx[LEN_TxAPDU]=0;
	LEN_TxAPDU+=1;
	//PIID-ACD修改
	
//时间标签
	p8tx[LEN_TxAPDU]=0;
	LEN_TxAPDU+=1;
//返回帧
	if(UARTCtrl->NEXT==0)//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
	{
		p8tx=(u8 *)Get_ADDR_UARTnTx(PORTn);
		i=p8rx[4];//取地址字节数
		i&=0x0f;
		i+=9;
		MR((u32)p8tx,(u32)p8rx,i);//复制接收头
		p8tx[3]|=0x80;
		
		MR(((u32)p8tx)+i,((u32)p8tx)+TxAPDUOffset,LEN_TxAPDU);
		i+=LEN_TxAPDU;
	//2byte FCS
	//1byte 0x16
		i+=3;
		UARTCtrl->TxByte=i;
		i-=2;
		p8tx[1]=i;
		p8tx[2]=i>>8;
		Uart_698_HCSFCS(p8tx);//整帧校验计算(HCS和FCS),同时加结束0x16;返回0=正确，1=错误
		UARTCtrl->Task=2;//等待单帧数据发送
	}
	else
	{
		//有下帧
		//copy rx到rx+Rxoffset
		p8rx=(u8 *)Get_ADDR_UARTnRx(PORTn);
		i=Get_LEN_UARTnRx(PORTn);
		x=p8rx[1]+(p8rx[2]<<8);
		x+=3;//整半字
		x>>=1;
		x<<=1;
		if((x+Rxoffset)>i)
		{
			x=i-Rxoffset;
		}
		x/=2;
		p16=(u16*)p8rx;
		while(x)
		{
			x--;
			p16[(Rxoffset/2)+x]=p16[x];
		}
//6.3.8.2.5　GetResponseNext数据类型
//GetResponseNext∷=SEQUENCE
//{
//  服务序号-优先级-ACD  	PIID-ACD，
//  末帧标志           	BOOLEAN，
//分帧序号           	long-unsigned，
//分帧响应             	CHOICE
//{
//错误信息    	    	[0]   DAR，
//  对象属性         	[1]   SEQUENCE OF A-ResultNormal，
//  记录型对象属性    	[2]   SEQUENCE OF A-ResultRecord
//}
//}
		p8tx=(u8 *)Get_ADDR_UARTnTx(PORTn);
		i=p8rx[4];//取地址字节数
		i&=0x0f;
		i+=9;
		MR((u32)p8tx,(u32)p8rx,i);//复制接收头
		p8tx[3]|=0x80;//0xA0
		p8tx[i]=p8tx[TxAPDUOffset];//读取响应
		//p8tx[i+1]=p8tx[TxAPDUOffset+1];//GeResponseRecord
		p8tx[i+1]=5;//分帧响应一个数据块 	[5]  GetResponseNext
		p8tx[i+2]=UARTCtrl->PIID;//PIID
		i+=3;
//  末帧标志           	BOOLEAN，
		if(UARTCtrl->NEXT==3)//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
		{
			p8tx[i]=1;
		}
		else
		{
			p8tx[i]=0;
		}
//分帧序号           	long-unsigned，
		p8tx[i+1]=UARTCtrl->NEXTBlock>>8;
		p8tx[i+2]=UARTCtrl->NEXTBlock;
//分帧响应             	CHOICE
//{
//	错误信息    	    	[0]   DAR，
//  对象属性         	[1]   SEQUENCE OF A-ResultNormal，
//  记录型对象属性    	[2]   SEQUENCE OF A-ResultRecord
//}
		if((UARTCtrl->GET_Reques_CHOICE==3)||(UARTCtrl->GET_Reques_CHOICE==4))
		{//3=读取一个记录型对象属性请求,4=读取若干个记录型对象属性请求
			p8tx[i+3]=2;//记录型对象属性    	[2]   SEQUENCE OF A-ResultRecord
		}
		else
		{
			p8tx[i+3]=1;//对象属性         	[1]   SEQUENCE OF A-ResultNormal
		}
		p8tx[i+4]=1;//1=数据
		
		i+=5;
		if(LEN_TxAPDU<3)
		{
			return;
		}
		MR(((u32)p8tx)+i,((u32)p8tx)+TxAPDUOffset+3,LEN_TxAPDU-3);
		i+=(LEN_TxAPDU-3);
	//2byte FCS
	//1byte 0x16
		i+=3;
		UARTCtrl->TxByte=i;
		i-=2;
		p8tx[1]=i;
		p8tx[2]=i>>8;
		Uart_698_HCSFCS(p8tx);//整帧校验计算(HCS和FCS),同时加结束0x16;返回0=正确，1=错误
		UARTCtrl->Task=2;//等待单帧数据发送
	}
	
}

u32 Uart_TimeTag(u8* p8rx)//时间标签有效性判断;入口:p8rx指向时间标签;返回:0=有效,1=无效
{
	u32 i;
	u32 TI;
	
	i=Check_pYYMDHMS_hex(p8rx);//年年月日时分秒合法检查,返回0合法,1非法
	if(i)
	{
		return 1;//返回:0=有效,1=无效
	}
	TI=(p8rx[8]<<8)+p8rx[9];//取频率值
	if(TI==0)
	{
		return 0;//返回:0=有效,1=无效
	}
	switch(p8rx[7])
	{
		case 0://秒      （0），
			break;
		case 1://分      （1），
			TI*=60;
			break;
		case 2://时      （2），
			TI*=60*60;
			break;
		case 3://日      （3），
		case 4://月      （4），
		case 5://年      （5）
		default:
			TI*=60*60*24;
			break;
	}
	i=YYMDHMS_Sub_hex((u8*)&Comm_Ram->DL698YMDHMS,p8rx);//hex时钟差值计算;入口:pRTC1(年年月日时分秒);pRTC2(年年月日时分秒);出口:pRTC2-pRTC1=HEX补码时钟快或慢的差值秒,pRTC1或pRTC2非法=0,pRTC2>=pRTC1差值为正,pRTC2<pRTC1差值为负
	if(i>>31)
	{
		i=~i;
		i++;
	}
	if(i>TI)
	{
		return 1;//返回:0=有效,1=无效
	}
	return 0;//返回:0=有效,1=无效
}

#endif
